Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/wikimediav20210402(2.8k)/en-ne.tmx
Source language: en
Languages: ne

source: Hiranyakashipu persecuted everyone for their religious beliefs including his son who was a Vishnu follower.[2] Vishnu descended as an anthropomorphic incarnation, with the body of a man and head and claws of a lion. He disemboweled Hiranyakashipu at the courtyard threshold of his house, at dusk, with his claws, while he lay on his thighs. Narasimha thus destroyed the evil demon and brought an end to the persecution of human beings including his devotee Prahlada, according to the Hindu mythology.[2] Vamana, the dwarf.
ne: मत्स्य, भगवानले प्रलयको समुद्र बिहार गर्दै सत्यव्रतलाई ज्ञान र भक्तिका उपदेशहरू दिए । हयग्रिव नाम गरेको राक्षसले वेदहरूलाई चोरेर समुद्रमा लुकाई राखेको थियो भगवान मत्स्यले हयग्रिवलाई मारेर वेदहरूको पनि उदार गर्नु भएको थियो। कुर्म, मन्दराचल पर्वत समुन्द्रको गहिराईमा डुब्न लाग्यो। यो देखेर देव दानवहरू फेरी बिष्णुको शरण लिन पुगे। भगवान विष्णुले पनि कछुवाको रूप धारण गरेर पर्वतलाई आफ्नो पिठमा अड्डाए। Varaha, पृथ्वीलाई लातिले हानेर समुन्द्रमा डुबाउने "हिरण्यक्ष" नाम गरेको राक्षसको बध गरेका थिए। जलमा डुबेको पृथ्वीलाई पूर्ववत गरी पूथ्वीको उद्दार गर्नु भएको थियो । नरसिंह दैत्यराज हिरण्यकशेपुको बध गर्नको निमित्त र भक्त प्रह्लादको उदार गर्नका निमित्त विष्णु भगवानले नरसिँहावतार धारण गर्नु परेको थियो। आधा शरिर सिँहको र आधा शरिर मान्छेको थियो। वामन भगवान विष्णुले अदितीको कोखबाट वामन अवतारको रुपमा जन्म लिए। भगवान वामन ८ बर्षको भएपछी ब्रह्माजीले व्रतबंध गरिदीए। व्रतवंधको देशान्तरमा जाने क्रममा भगवान वामन बली राजा कहाँ गए। वामनलाई देखेर राजा बलिले आदर पूर्वक आफुकहाँ आएको कारण सोधे । तब वामनले बलीलाई आफुले केही दान लिने तर त्यो दिने र नदिने कुरा पहिल्यो वाचा गर्न आग्रह गरे। तब बलिले पनि मागेको चिज दिने वाचा गरे। यसरी वाचा दिलाई सके पछि वामनले हरि भक्ती गरेर बस्नको लागि मात्र ३ पाउ जमिन चाहिएको कुरा व्यक्त गरे। यो सुनेर राजा बलिले अहंकारका साथ भने "म स्वर्गको राजा हुँ मसँग यती सानो चिज माग्नु भयो तैपनि दिन्छु भनेर संकल्प गर्नलागे तब शुक्रचार्यजीले यी वामन सामान्य मानिस नभएर भगवान विष्णू भएको जानकारी दिए र संकल्प गर्नबाट रोक्ने प्रयास गरे। तर बलीले मानेनन् संकल्प गरिसके पछि राजा बलिले वामनलाई जमीन नाप्ऩ लगाए। तब वामले आफ्नो सानो रुपलाई बढाएर एक पाईला पृथ्वीमा र अर्को पाइला स्वर्गमा राखे। अब अर्को पाईला राख्ने ठाउँ नभएका कारण राजा बली चिन्तित भए। पछि प्रह्लादलाई भगवानको लिला थाहा पाएर प्रार्थना गरे। तब वामनले राजा बलीलाई एक पटक स्वर्गको राजा बनाउने आश्वासन दिएर सुतलमा पठाए। आफु पनि राजा बलीसँग छलकपट गरेको पश्चाताप मेटाउन जीवन भर राजा बलिको द्वार पाले भएर बस्ने वाचा दिए। बलीले दानको संकल्प गरीसकेका कारण वामनको एक पाईला आफ्नो शिरमा राखेर दानको विधी पुरा गरे। त्यस पछि वामनले इन्द्रलाई स्वर्ग दिलाएर राजा बलिका साथ सुतलमा गए । परशुरामको मुख्य हतियार परशु (बन्चरो) भएकोले उनको नाम परशुराम भएको मानिन्छ । परशुरामका पिताको नाम ऋषि जमदग्नि र माताको नाम रेणुका थियो । परशुराम एक ऋषिपुत्र भए पनि उनमा क्षत्रीय गुणहरू थिए । परशुरामले २१ पटक पृथ्वीका क्षत्रियहरूको संहार गरेका थिए ।

source: Buddha is sometimes depicted in Hindu scriptures as a preacher who deludes and leads demons and heretics away from the path of the Vedic scriptures, but another view praises him a compassionate teacher who preached the path of ahimsa (non-violence).[7][6][8] Kalki is described as the final incarnation of Vishnu, who appears at the end of each Kali Yuga. He will be atop a white horse and his sword will be drawn, blazing like a comet. He appears when only chaos, evil and persecution prevails, dharma has vanished, and he ends the kali yuga to restart Satya Yuga and another cycle of existence.[9][10]
ne: श्रीराम अवतार, अयोध्याको राजा दशरथ र रानी कौशल्याको सबै भन्दा जेठो पुत्र थिए। रामकी पत्नीको नाम सीता थियो (जसलाई लक्ष्मीको अवतार मानिन्छ) र उनका तीन भाइ थिए: लक्ष्मण, भरत र शत्रुघ्न । रामले राक्षस जातिको राजा रावणको वध गरे । बलराम, बलराम भगवान श्रीकृष्ण दाजु तथा गोकुलका राजा नन्द र यसोदाका पुत्र हुन्। उनलाई शेषावतार पनि भनिन्छ तसर्थ उनी अत्यधिक क्रोधी पनि थिए । कृष्ण[7] श्रीकृष्णलाई जन्मिएकै घडी कंशबाट बचाउन उनका पिता वसुदेवले गोकुलवासी नन्द गोपका घरमा छोडेका थिए। त्यसैले श्रीकृष्णको बाल्यकाल नन्द गोपका घरमा बितेकाल उनलाई गोपाल तथा नन्दलाल नामले पनि जानिन्छ। उनले महाभारतको युद्धको समयमा अर्जुनलाई दिएको गीता उपदेशलाई विश्वको उत्कृस्ट उत्प्रेरणाको शिक्षा मानिन्छ भगवान् गौतम बुद्ध बौद्ध धर्मका प्रणेता हुन् । उनी विभिन्न ठाउँ पुगी दु:ख निवारण सम्वन्धी आफूलाई प्राप्त महाज्ञान बाँड्न रातदिन लागिपरे। कल्की अवतार कलि युगको अन्तको लागि हुन्छ। जब कलियुगमा मानिसहरूले धर्मको अनुसरण गर्न बन्द गरि दिन्छ तब यो अवतार हुन्छ।

source: Preceded by Virochana Daityas unknown Succeeded by Banasura
ne: पुर्वाधिकारी विरोचन दैत्य अज्ञात उत्तराधिकारी बाणासुर

source: Mahabali (IAST: Mahābalī), or Great Bali, also known as Māveli, was a benevolent Asura King in ancient Hindu antiquity. Mahabali was the great grandson of Hiranyakshipu, the grand son of Prahlada and son of Virochana. After he failed to fulfill his promise to provide three paces of land for Vamana,[3] Vamana sends Mahabali to live in netherworld for some period.[4] Pleased by Mahabali's devotion, Vamana also blesses Bali to be the Indra during the period of the Manu known as Sāvarṇi.[5]
ne: महाबलि वा बलि राजा, प्राचीन हिन्दु मिथक पौराणिक कथा अनुसार एक दानवीर असुर राजा थिए । राजा बलि हिरण्यकशिपुका पनाति , प्रह्लादका नाति र विरोचनका पुत्र थिए । हिराण्यकशेपुलाई मारे पछि भक्त प्रह्लादलाई भगवान विष्णूले अब यो कुलमा जन्मेको मानिसको संहार गर्ने छैन भन्ने वाचा दिनु भएको थियो । अश्वमेघ यज्ञ समापन गरिरकेको बेलामा, वामन रूप मा ब्राह्मण वेशधारी विष्णु उपस्थित भए । वामनलाई देखेर राजा बलिले आदर पूर्वक आफुकहाँ आएको कारण सोधे । तब वामनले बलीलाई आफुले केही दान लिने तर त्यो दिने र नदिने कुरा पहिल्यो वाचा गर्न आग्रह गरे। तब बलिले पनि मागेको चिज दिने वाचा गरे। यसरी वाचा दिलाई सके पछि वामनले हरि भक्ती गरेर बस्नको लागि मात्र ३ पाउ जमिन चाहिएको कुरा व्यक्त गरे। यो सुनेर राजा बलिले अहंकारका साथ भने "म स्वर्गको राजा हुँ मसँग यती सानो चिज माग्नु भयो तैपनि दिन्छु भनेर संकल्प गर्न लागे तब शुक्रचार्यजीले यी वामन सामान्य मानिस नभएर भगवान विष्णू भएको जानकारी दिए र संकल्प गर्नबाट रोक्ने प्रयास गरे। तर बलीले मानेनन् संकल्प गरिसके पछि राजा बलिले वामनलाई जमीन नाप्ऩ लगाए। वामनले तीन पाउँ जमिन / भुमि दान मागे र संकल्प पूरा हुने बित्तिकै विशाल रूप धारण गरेर प्रथम दुई पाउँले पृथ्वी र स्वर्ग ओगटे। बाँकी दानको लागि बलिले आफ्नो शिरको नाप दिए । [3] भगवानले बलिलाई पाताल लोकमा केहि समय बस्न लगाए ।[4] बलिको भक्ति र उदारता देखेर वमनले उनलाई मनु को समयमा इन्द्र हुने बरदान दिए ।[5]

source: The time under his rule was considered one of great prosperity and happiness. It is in fact this success as a king that led the gods to be wary of him and bring his demise at the hands of Vamana. To appease his subjects who were distraught at his death, Mahabali is allowed to return to Earth once every year on the auspicious festival of Onam in kerala and in costal of Karnataka (Mangalore and Udupi)celebrating during festival of deepavali.
ne: बलि उदार, परोपकारी, दयालु र दानवीर राजा थिए । उनको शासनको समयलाई एक समृद्ध र खुसियालीको युग मानिन्थ्यो । वास्तवमा उनको यहि सफलताले देवताहरु उनी देखि चिन्तित हुन् थाले र वामन अवतारको सहयोगबाट उनको पतन गराए । आफ्नो मृत्युको विषय बाट चिन्तित रहेका आफ्ना प्रजाहरुको मन् शान्त पार्न, उनलाई प्रत्येक वर्ष दिपावली पर्व मा एक पटक पृथ्वीमा फर्कने अनुमति दिइएको थियो ।[6]

source: Balipratipada Banasura Chiranjivins Rakshasa Beli Mawr
ne: बाणासुर राक्षस

source: Etymology and scriptural context
ne: शब्द-व्युपत्ति

source: Other Chiranjivis
ne: अन्य चिरञ्जीवि

source: Mention of Chiranjivi in Hindu Scripture
ne: हिन्दू धर्मशास्त्रको चिरजीवी को उल्लेख

source: Chiranjivi (Sanskrit nominative sing. ciranjīvi, चिरञ्जीवि) are seven immortal living beings in Hinduism who are to remain alive on Earth until the end of the current Kali Yuga.
ne: चिरञ्जीवि (Sanskrit nominative sing. ciranjīvi, चिरञ्जीवि) are हिन्दू धर्म का आठ अमर व्यक्ति हुन् जो कलि युग को अन्त्यसम्म पृथ्वीमा जीवित रहनेछन ।

source: The Chiranjivis are as follows:
ne: चिरञ्जीविहरु यस प्रकार रहेका छन् :

source: He represents erudition and wisdom. He was the son of sage Parashara and grandson of sage Vashishtha. He was born towards the end of Tretayuga, lived to see the complete Dwaparayuga, and also saw the initial phase of Kali Yuga.
ne: व्यास (ऋषि), महाभारतका रचयिता. उनले ज्ञान र बुद्धि को प्रतिनिधित्व गर्छन् ।उनी परासर मुनिका पुत्र र वशिष्ठ ऋषिका नाति थिए । उनी त्रेता युगको उत्तरार्धमा जन्मेका थिए, सकल द्वापर युग देखे,भोगे बाचे र कलि युगको पूर्वार्ध समेत देखे ।

source: Hanuman, served Rama. He stands for selflessness, courage, devotion, strength, and righteous conduct.
ne: हनुमान, रामका भक्त थिए ।. उनी निश्वार्थ , साहस , भक्त , सामर्थ र सुकर्मको लागि चिनिन्छन ।

source: Parashurama, 6th avatar of Vishnu, knowledgeable about all astras, sastras and divine weapons. The Kalki Purana writes that he will re-emerge at the end of time to be the martial guru of Kalki. He will then instruct the final avatar to undertake penance to receive celestial weaponry, required to save mankind at the end time.
ne: परशुराम, विष्णुका छैटौ अवतार हुन् । उनी सम्पूर्ण अस्त्र शस्त्र र ईश्वरीय हतियारको ज्ञाता थिए । कल्की पुराणका अनुसार उनी कल्की अवतारको गुरुको रुपमा कलि युगको अन्त्य मा उदाउनेछन् । उनले विष्णुको आखिरी अवतारलाई दिव्य आकाशीय शस्त्र -अस्त्र हासिल गर्न , धैर्य हुन् र मानवता को कल्याण गर्न दिक्षा प्रदान गर्ने छन् ।

source: Later, he was crowned king of Lanka after Ravana was killed by Rama. He stands for righteousness. Vibhishana is not a true Chiranjivi, as his boon of longevity is to remain on the earth only until the end of the Mahayuga.
ne: विभीषण, रावणका भाइ । विभीषणले रामको रावणसंग युद्ध हुनु भन्दा अगाडी नै राम संग आत्मसमर्पण गरेका थिए । रावणले युद्धमा वीरगति प्राप्त गरे पछी उनी लंकाका राजा भएका थिए ।उनी धर्म र नीतिपरायणता को लागि चिनिन्छन् । उनी पूर्ण रुपमा चिरन्जीवी होइनन् र महायुगको अन्त्य सम्म मात्र पृथ्वीमा रहन बरदान पाएका थिए ।

source: Drona did many years of severe penance to please lord Shiva in order to obtain a son who possessed the same valiance as Lord Shiva. Ashwatthama is the avatar of one of the eleven Rudras. Ashwatthama and Kripa are believed to be the lone survivors still living who actually fought in the Kurukshetra War.He might be immortal but Krishna gave him a curse that, he would live forever but can neither communicate with anyone nor touch anything, with his body covered with painful sores and ulcers that would never cure.[3]
ne: अश्वत्थामा, महान योद्धा तथा राजगुरु द्रोणाचार्य का पुत्र a, a great warrior. द्रोणले कयौ बर्षको भक्तिले भगवान शिवलाई प्रसन्न बनाएर पुत्रको बरदान पाएका थिए जो संग भगवान शिवको मणि रत्न थियो । अश्वत्थामालाई रुद्रको ११ अवतारमध्ये एक मानिन्छ। अश्वत्थामा र क्रिपाचार्य कुरुक्षेत्रको युद्ध जीवित योद्धा थिए । कृष्णले उनलाई यो श्राप दिएका थिए कि उनी सधै बाचिरहेने छन् तर कोहि संग बोल्न र कसैलाई छुन सक्ने छैनन् , उनी कहिल्यै निको नहुने कुष्ठरोगबाट संक्रमित हुने छन् ।[3]

source: Bali, also called Maha Bali (his son was Banasur), was the virtuous emperor of the three worlds and Son of Virochana and grandson of Prahlada who were of Asura descent. During the Vamana avatar, Lord Vishnu blessed him to be a Chiranjivi. Every year on the day of Onam (official festival of Kerala), he descends to earth from the heavens to visit his people, those of the region of Kerala.
ne: बलि राजा (बाणासुर पुत्र, राजा बलि हिरण्यकशिपुका पनाति , प्रह्लादका नाति र असुर कुलका थिए र तीनै लोकका अधिपति थिए । वामन अवतारको बेला , भगवान विष्णुले उनलाई चिरञ्जीवि हुने बरदान दिएका थिए।

source: Kripa, royal guru of the princes in the Mahabharata.
ne: कृपाचार्य, महाभारत हस्तिनापुरका कुल हरु थिए

source: Jambavan Sage Markandeya Devapi Sage Maru Saptarishis Kag Bhusundi (Sage living in the form of a crow) Muchukunda the son of Mandhatri Banasur (son of King Bali) by Boon of Shiva Udal.
ne: मार्कण्‍डेय बाणासुर सप्त ऋषि

source: इस श्लोक का अर्थ यह है कि इन आठ लोगों (अश्वथामा, दैत्यराज बलि, वेद व्यास, हनुमान, विभीषण, कृपाचार्य, परशुराम और मार्कण्डेय ऋषि) का स्मरण सुबह-सुबह करने से सारी बीमारियां समाप्त होती हैं और मनुष्य 100 वर्ष की आयु को प्राप्त करता है।
ne: अर्थात् कि यी आठ व्यक्ति (अश्वथामा, दैत्यराज बलि, वेद व्यास, हनुमान, विभीषण, कृपाचार्य, परशुराम र मार्कण्डेय ऋषि)को स्मरण बिहान-बिहान गर्नाले सम्पूर्ण बिमारी समाप्त हुन्छ र मनुष्य १०० वर्ष आयु को प्राप्त गर्न सक्छ।

source: Culinary uses
ne: प्रयोग

source: Nori sheet under a microscope, magnification 200×
ne: नोरी पत्र सुक्ष्मदर्शक यन्त्रबाट हेर्दा, magnification 200×

source: Nori (海苔) is the Japanese name for edible seaweed (a "sea vegetable") species of the red algae genus Pyropia, including P. yezoensis and P. tenera. It has a strong and distinctive flavor. It is used chiefly in Japanese cuisine as an ingredient to wrap rolls of sushi or onigiri, in which case the term refers to the dried sheets.
ne: नोरी Nori (海苔) खान मिल्ने समुन्द्री वनस्पति हो। यो चखिलो र अलग मिठास भएको जापानी खाना हो। यो प्रोपिया प्रजातिको रातो लेऊ हो। कागजको पाना आकारको यो खाना कूक हरूले जापानी खाना खासगरी सुसीको रोल बेर्नमा प्रयोग गर्छन्।

source: The finished dried sheets are made by a shredding and rack-drying process that resembles papermaking. They are sold in packs in grocery stores for culinary purposes. Since nori sheets easily absorb water from the air and degrade, a desiccant is needed when storing nori for any significant time.
ne: नोरीको सुख्खा पाताहरू समुन्द्री लेउलाई पिसेर र्‍याकमा सुकाएर कागज बनाए जसरी नै तयार गरिन्छ । नोरी तयार भएपछि प्याकिङ गरेर बजारमा पठाइन्छ। यसले हावामा रहेको आर्द्रता बाट समेत पानि सोस्ने भएकोले लामो समय भण्डारण गर्नकालागि यसलाई हावा नछिर्नेगरी प्याक गरेर सुख्खा ठाउँमा राखिन्छ।

source: Cakes and Food Made of Seaweed by Kubo Shunman, 19th century
ne: १९ औं शताब्दिमा कोबो शुमानद्वारा समुन्द्री झारबाट बनाइका केकहरू

source: Toasting a sheet of nori. 1864
ne: नोरीको पत्र टोस्ट गर्दै, सन् १८६४

source: Originally, the term nori was generic and referred to seaweeds, including hijiki.[1] One of the oldest descriptions of nori is dated to around the 8th century. In the Taihō Code enacted in 701, nori was already included in the form of taxation.[2] Local people have been described as drying nori in Hitachi Province Fudoki (721–721), and nori was harvested in Izumo Province Fudoki (713–733), showing that nori was used as food from ancient times.[3] In Utsubo Monogatari, written around 987, nori was recognized as a common food. Nori had been consumed as paste form until the sheet form was invented in Asakusa, Edo (contemporary Tokyo), around 1750 in the Edo period through the method of Japanese paper-making.[4][5][6][7]
ne: मूलत नोरी शव्दले हिजिकी लगायतका समुन्द्री झार जनाउँछ[1] नोरीको अहिलेसम्मको सबैभन्दा पुरानो वर्णन आठौं शताब्दीको पाइएको छ। सन् ७०१ मा लागू भएको ताओ कोड (कानून)मा नोरीमा करलाग्ने वस्तुमा सूचिकृत भएको थियो। [2] सन् ७२१ तिर फुदोकीको हिटाची प्रान्तका बासिन्दाले नोरी सुकाउँथे भन्ने वर्णन पाइन्छ। त्यसैबेला ७१३ देखि ७२३ ताका इजुमो प्रान्तमा नोरी खेती गरिएको वर्णन बाट प्राचीन काल देखि नै नोरीको प्रचलन थियो भन्ने आधार मिल्छ। [3] सन् ९८७ ताका लेखिएको उत्सुबो मोनोगातारी पुस्तकमा नोरीलाई सामान्य प्रचलनको खानाको रूपमा उल्लेख गरिएको छ। पत्रको रूपमा विकास हुनु अघि यो गिलो पेस्टको रूपमा प्रयोग हुन्थ्यो। सन् १७५० तिर त्यसबेलाको आकुसा इदो (हालको टोकियो), मा कागज बनाउने तरिका प्रयोग गरी नोरीको प्रशोधन सुरू भयो।[4][5][6][7]

source: It is also a garnish or flavoring in noodle preparations and soups. It is most typically toasted prior to consumption (yaki-nori). A common secondary product is toasted and flavored nori (ajitsuke-nori), in which a flavoring mixture (variable, but typically soy sauce, sugar, sake, mirin, and seasonings) is applied in combination with the toasting process.[14] It is also eaten by making it into a soy sauce-flavored paste, nori no tsukudani (海苔の佃煮).
ne: नोरी धेरजसो सुसी र ओनिगिरी लाई बेर्ने काममा प्रयोग गरिन्छ। नुडल्स र सुपलाई मिठास थप्ने अल‌कारको रूपमा पनि प्रयोग हुन्छ। यसलाई खानुपूर्व "याक नोरी" भनेर विशेष रूपले टोस्ट गरिन्छ। सामान्यतया यसमा भात बेह्रेर पनि खाइन्छ।

source: ↑ Kodansha encyclopedia of Japan. 6. Kōdansha.
ne: ↑ Kodansha encyclopedia of Japan.

source: ISBN 978-0-87011-620-9. The word nori is used in Japan both as a general term for seaweed and as a name for a species of red algae (Pyropia tenera) that is commonly used as a foodstuff and is also known as asakusa-nori..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ Nisizawa, Kazutosi; Noda, Hiroyuki; Kikuchi, Ryo; Watanabe, Tadaharu (September 1987). "The main seaweed foods in Japan".
ne: Kōdansha.

source: Hydrobiologia.
ne: 1983. p. 37.

source: 151-152 (1): 5–29. doi:10.1007/BF00046102.
ne: ISBN 978-0-87011-620-9.
